Revit 2027 API
AlignmentStationLabel.Station Property
 The alignment station at which the SpotDimension is placed.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Station { get; set; }
Public Property Station As Double
	Get
	Set
public:
property double Station {
	double get ();
	void set (double value);
}
member Station : float with get, set
Property Value
Double
See Also
Reference
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace